function main(n, p) {
    const fromFront = Math.floor(p / 2);
    const fromBack = Math.floor(n / 2) - fromFront;

    return Math.min(fromFront, fromBack);
}

console.log(main(20000, 17));

/*
 * 7/9/2026: 16.000.000đ - 5.000.000đ - 3.500.000đ - 3.000.000đ - 3.500.000đ = 1.000.000đ
 * 10/9/2026: 12.000.000đ + 1.000.000đ = 13.000.000đ 
 * Ăn xài 8.000.000đ 
 * Cổ phiếu 3.000.000đ
 * Saving 2.000.000đ --------------
 */

/*
 * 5/10: 16.000.000đ - 5.000.000đ - 3.500.000đ - 1.000.000đ = 6.500.000đ
 * 10/10: 8.000.000đ + 6.500.000đ = 14.500.000đ
 * Ăn xài 8.000.000
 * Cổ phiếu 3.000.000đ
 * Saving 3.500.000đ --------------
 * Total Saving 5.500.000đ
 */

/*
 * 5/11: 5/10: 16.000.000đ - 5.000.000đ - 3.500.000đ - 1.000.000đ = 6.500.000đ
 * 10/10: 8.000.000đ + 6.500.000đ = 14.500.000đ
 * Ăn xài 8.000.000đ
 * Cổ phiếu 3.000.000đ
 * Saving 3.500.000đ --------------
 * Total Saving 9.000.000đ
 * 
 * Tính đến lúc này total cổ phiếu = 11.000.000đ + 9.000.000đ = 20.000.000đ
 */

